{
  "_name_or_path": "samrawal/bert-base-uncased_clinical-ner",
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "B-COUGH",
    "1": "I-COUGH",
    "2": "B-BREATHLESSNESS",
    "3": "I-BREATHLESSNESS",
    "4": "B-DIZZINESS",
    "5": "I-DIZZINESS",
    "6": "B-HEADACHE",
    "7": "I-HEADACHE",
    "8": "B-CHILLS",
    "9": "I-CHILLS",
    "10": "B-CHEST_PAIN",
    "11": "I-CHEST_PAIN",
    "12": "B-BACK_PAIN",
    "13": "I-BACK_PAIN",
    "14": "B-MUSCLE_PAIN",
    "15": "I-MUSCLE_PAIN",
    "16": "B-JOINT_PAIN",
    "17": "I-JOINT_PAIN",
    "18": "B-NECK_PAIN",
    "19": "I-NECK_PAIN",
    "20": "B-STOMACH_PAIN",
    "21": "I-STOMACH_PAIN",
    "22": "O"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-BACK_PAIN": 12,
    "B-BREATHLESSNESS": 2,
    "B-CHEST_PAIN": 10,
    "B-CHILLS": 8,
    "B-COUGH": 0,
    "B-DIZZINESS": 4,
    "B-HEADACHE": 6,
    "B-JOINT_PAIN": 16,
    "B-MUSCLE_PAIN": 14,
    "B-NECK_PAIN": 18,
    "B-STOMACH_PAIN": 20,
    "I-BACK_PAIN": 13,
    "I-BREATHLESSNESS": 3,
    "I-CHEST_PAIN": 11,
    "I-CHILLS": 9,
    "I-COUGH": 1,
    "I-DIZZINESS": 5,
    "I-HEADACHE": 7,
    "I-JOINT_PAIN": 17,
    "I-MUSCLE_PAIN": 15,
    "I-NECK_PAIN": 19,
    "I-STOMACH_PAIN": 21,
    "O": 22
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.25.1",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
